#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Завдання 1

	char sym;

	cout << "Введи будь-який символ, або цифру: ";
	cin >> sym;
	cout << endl;
	if (sym >= 65 && sym <= 122) {
		cout << "Ви ввели букву." << endl;
	}
	else if (sym >= 48 && sym <= 57) {
		cout << "Ви ввели цифру." << endl;
	}
	else if (sym >= 33 && sym <= 47 || sym >= 58 && sym <= 64 || sym >= 91 && sym <= 96 || sym >= 123 && sym <= 126) {
		cout << "Ви ввели знак." << endl;
	}
	else {
		cout << "Ви ввели символ або знак, який програма не розпізнає." << endl;
	}

	// Завдання 2

	char choice; // АААААА, ЕКОНОМІЯ ОПЕРАТИВКИИИИИИИИИИИИИИИ
	double des_income, code_lines, income, fine;
	short lateness;

	// сууууууууууууууууупер довга строка коду:
	cout << "Вітаємо в програмі для розрахунку доходу Васі! Варіанти роботи програми:" << endl << endl << "1. Визначити скільки рядків коду треба написати Васі для отримання бажаного доходу.\nПотрібні дані: баж. дохід, к-ть запізнень" << endl << endl << "2. Визначити скільки разів Вася може запізнитись, якщо хоче отримати бажаний дохід.\nПотрібні дані: к-ть рядків коду, баж. дохід" << endl << endl << "3. Визначити скільки грошей отримає Вася та чи отримає взагалі.\nПотрібні дані: к-ть рядків коду, к-ть запізнень" << endl << endl;
	cout << "Оберіть, яку дію Ви хочете зробити вівши цифру вибору, 1, 2 або 3: ";
	cin >> choice;
	cout << endl;
	if (choice == 49) {
		cout << "Ви обрали варіант: \"Визначити скільки рядків коду треба написати Васі для отримання бажаного доходу.\"" << endl;
		cout << "Введіть бажаний дохід Васі: ";
		cin >> des_income;
		cout << "Введіть кількість запізнень Васі: ";
		cin >> lateness;
		fine = (lateness / 3) * 20;
		code_lines = ((des_income + fine) / 50.0) * 100.0;
		cout << "Щоб Вася отримав бажаний дохід маючи " << lateness << " запізнень, він має написати " << code_lines << " рядків коду.";
	}
	else if (choice == 50) {
		cout << "Ви обрали варіант: \"Визначити скільки разів Вася може запізнитись, якщо хоче отримати бажаний дохід.\"" << endl;
		cout << "Введіть скільки рядків коду написав Вася: ";
		cin >> code_lines;
		cout << "Введіть бажаний дохід Васі: ";
		cin >> des_income;
		lateness = (((code_lines / 100) * 50 - des_income) / 20) * 3;
		if (lateness <= 0) {
			cout << "Вася не може запізнитись жодного разу, інакше не отримає бажаний дохід!";
		}
		else {
			cout << "Вася може запізнитись приблизно " << lateness << " разів, але краще взагалі не запізнюватись.";
		}
	}
	else if (choice == 51) {
		cout << "Ви обрали варіант: \"Визначити скільки грошей отримає Вася та чи отримає взагалі.\"" << endl;
		cout << "Введіть скільки рядків коду написав Вася: ";
		cin >> code_lines;
		cout << "Введіть скільки разів запізнився Вася: ";
		cin >> lateness;
		income = (code_lines / 100) * 50 - (lateness / 3) * 20;
		if (income <= 0) {
			cout << "Вася не отримає грошей, бо багато запізнювався.";
		}
		else {
			cout << "Вася отримає " << income << " доларів.";
		}
	}

	return 0;
}