using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson1
{
    internal class Homework
    {
        /* 1. Яка тема з опрацьованого матеріалу здалася тобі найцікавішою? Чому саме вона?
            Мене зацікавила унікальність .NET'у, 
            точніше його можливість приймати різні мови, які працюють з .NET, завдяки тому, 
            що код написаний на наприклад C# - перекладається на IL-код. 
            Це дає можливість працювати різним програмістам, з різними мовами, які вони використовують. 
            Та ще полегшує поширення програм на різні платформи.
         

            2. Яке поняття було для тебе найскладнішим? Спробуй пояснити його своїми словами так, як ти його зрозумів.
                Складно виділити щось більш складне, оскільки я ніби все зрозумів, та й не так багато розібрали, це було лише перше заняття, 
                але в той самий час - мені складно самотушки пояснити щось з тем.
                Тож скажімо так: більш складним для розуміння була система компіляції коду, робота JIT'у, Just In Time. Але як я це зрозумів:
                    Написаний нами код ЧАСТКОВО компілюється в IL-код, який можна навіть спробувати прочитати, 
                    але його великий плюс в тому, що його можна перекласти в зворотньому напрямку, на будь-яку мову яка працює з .NET, 
                    що дає змогу різним програмістам працювати над однією програмою різними мовами.
                    Далі код збирається вже в програму, .exe або .dll файл, який потім відкриває користувач (обов'язково маючи встановлений .NET у себе), 
                    але саме тут з'являється той самий JIT, який вже на пристрої користувача повністю докомпілює код в машинний код, але не построково, а кусками коду,
                    які потім стають кешем і пришвидшують подальші запуски програми, бо компілятору не потрібно буде кожен раз все компілювати.
                    

            3. Назви одну річ про C# або .NET, яка тебе здивувала або виявилася не такою, як ти очікував.
                А про що тут казати, якщо такого немає? Для мене вся ця інформація була новою, я просто нічого не міг очікувати ;D
                    Можливо можна сказати про компіляцію коду, бо раніше, що в Пайтоні, що в Плюсах - був построковий компілятор, 
                    який опрацьовував кожен раз кожну стрічку коду зверху вниз, а тут компіляція коду це якийсь ЩЕДЕВРЬ мистецтва.


            4. Якби тебе попросили пояснити людині, яка не знайома з .NET, що це таке, як би ти це зробив у 2–4 реченнях? Не використовуй формальне визначення.
                Та за шо таке завдання T_T , насправді тут пояснення може бути різним, наприклад пояснити людині яка взагалі не знайома з програмуванням, та людині яка знає C++.
                    
                    .NET це система, яка дозволяє писати код на різних мовах, але потім перекладає це у IL-код. 
                    А під час запуску програми, запускається так званий JIT, який перетворює IL-код в машинний код, який вже зрозуміє комп'ютер або навіть телефон.
                    Можна сказати, що .NET - це свого роду перекладач між програмістом та машиною.

            
            5. Обери одну конструкцію C#, яку ти вивчив (if, switch, цикл, типи даних тощо). Придумай власну ситуацію, у якій ти б її використав.
            
                Я оберу if, це, на мій погляд, найпоширеніша конструкція в програмуванні. 
                Найпростіше її використання, яке одразу приходить на думку - це, звичайно, перевірка віку людини, але це ми проходили на занятті, тож інший приклад:
                if можна було б використати разом із циклом для аналізу тексту, щоб отримати, наприклад, 
                кількість символів у тексті, кількість слів, розділових знаків тощо. Цикл проходив би по всьому тексту, 
                а if перевіряв би кожен символ: чи є він розділовим знаком, пробілом, літерою тощо. 
                Таким чином можна було б визначити, де починаються та закінчуються слова і порахувати потрібну інформацію про текст.


            6. Напиши невеликий фрагмент C#-коду на 5–10 рядків, використовуючи вивчені конструкції. Ідею програми придумай сам та коротко поясни, що вона робить.

                int[] numbers = { 9, 5, 2, 7, 3, 0, 8 };
                int countEven = 0;
                int countOdd = 0;
                
                for (int i = 0; i < numbers.Length; i++)
                {
                    if (numbers[i] == 0)
                    {
                        continue;
                    }
                    else if (numbers[i] % 2 == 0)
                    {
                        countEven++;
                    }
                    else
                    {
                        countOdd++;
                    }
                }

                Console.WriteLine($"Кількість парних чисел: {countEven}");
                Console.WriteLine($"Кількість непарних чисел: {coundOdd}");
                
                Ця програма проходить циклом for по списку чисел, та перевіряє кожне число конструкцією if.
                Якщо число - це нуль, то програма його ігнорує, та йде на наступне число.
                Якщо число парне, програма записує +1 до кількості парних чисел, яка зберігається в змінній countEven.
                А якщо число непарне, програма записує +1 до кількості НЕпарних чисел, яка зберігається вже в змінній countOdd.
                

            7. Порівняй C# з будь-якою мовою програмування, яку ти вже використовував. Назви одну схожість та одну відмінність, які ти помітив. Якщо C# — твоя перша мова, напиши, що в ній здалося тобі найбільш незвичним.

                    Оскільки ми вже працювали з C++, то порівнювати C# я буду саме з ним, це все ж таки родичі. 
                    Схожість одразу видно як тільки починаєш писати щось на C#, а саме те, що структура коду, та багато чого не просто схоже, а один в один. 
                    Це насправді полегшує роботу з С#, бо з немалою частиною конструкцій, функцій та з типами даних вже знайомий.

                    Відмінністю ж для мене стало те, що в C# не потрібно постійно думати про роботу з пам'яттю, 
                    тут в тебе на плечі сидить ангел-охоронець у вигляді Garbage Collector, який буде видаляти "зайві" речі, які не використовуються, або перестали використовуватись,
                    тоді як у C++ програмісту треба за всим цим слідкувати самотушки, та думати де і як правильно видалити сміття.

            
            8. Якби тобі потрібно було повторити весь опрацьований матеріал за 5 хвилин, які три речі ти вважав би найважливішими?

                1) Унікальність .NET'у, можливість працювати з різними мовами програмування.
                2) Основні конструкції - типи даних, if, else, switch, for, while. Все завдяки чому програма може робити абсолютно різні речі.
                3) Відмінності та схожість C# та C++ - робота з пам'яттю, Garbage Collector та в цілому підхід до написання коду.

           
            9. Яку з опрацьованих тем ти поки не зміг би впевнено пояснити іншій людині? Що саме в ній залишається незрозумілим?
                
                Напевно, я поки не зміг би впевнено пояснити іншій людині, як саме працює JIT-компіляція. 
                Сам принцип я зрозумів: спочатку код переходить у IL, а під час запуску програми JIT перетворює його в машинний код. 
                Але якщо потрібно було б детально пояснити, що саме відбувається всередині цього процесу і як JIT вирішує, який код компілювати, 
                я б вже не зміг би відповісти впевнено.


            10. Оціни своє розуміння матеріалу від 1 до 10. Що конкретно тобі потрібно зрозуміти або спробувати, щоб додати до своєї оцінки ще один бал?
                
                Я б оцінив своє розуміння матеріалу на 8 з 10. 
                Але щоб додати ще один бал, мені потрібно більше попрактикуватися з C# і попрактикуватись в написанні програм, 
                    використовуючи вивчені конструкції. 
                Так я зможу не просто розуміти матеріал, а й впевнено використовувати його на практиці та, сподіваюсь, пояснювати своїми словами.

                
            Секунда чесності: було використано трохи ЖЕПЕТІ для виправлення помилок, та місцями кращого формулювання. Ну, розумієте, щоб менше крінжово виглядати ;}
        */
    }
}
