using System;
using System.Collections.Generic;
using System.Text;

namespace Lesson2
{
    internal class Homework
    {
        /*
            1. Придумай власну ситуацію, у якій тобі знадобився б одновимірний масив. Що саме ти б у ньому зберігав і чому масив тут підходить?
                Одновимірний масив було б доречно використати для зберігання, наприклад, оцінок учня. 
                Він добре підходить для цієї задачі, оскільки всі значення мають один тип - int (Частіше за все).


            2. Уяви, що тобі потрібно зберігати ігрове поле. Який тип масиву ти б використав: одновимірний, багатовимірний чи «рваний»? Поясни свій вибір.
                Я б обрав багатовимірний масив, а точніше двовимірний для ігрового поля.
                Оскільки ігрове поле, типу поля для хрестиків-ноликів, має рядки та стовпці. 
                Саме двовимірний масив допоможе зберігати таке поле, а до кожної клітинки можна буде звернутися за двома координатами.
        
            
            3. Придумай ситуацію, у якій «рваний» масив був би зручнішим за звичайний двовимірний. Намалюй або опиши приблизну структуру такого масиву.
                Так, я загуглив... "Рваний" масив це масив з вкладених масивів, які можуть мати різний розмір. Окееееей........ (Просто я такої назви не пам'ятаю з уроків)
                Тоді можна взяти приклад з першого завдання, але трохи змінити його:
                    Ми будемо використовувати "рваний" масив для зберігання тих самих оцінок, але вже різних учнів. 
                    "Рваний" масив дасть нам змогу зберігати для кожного учня різну кількість оцінок. 
                     Наприклад першому поставили всього 2 оцінки, другому - 5, а третьому - 4.

            
            4. Коли ти використав би `foreach` замість звичайного `for`? Наведи власний приклад і поясни, чому в цій ситуації `foreach` зручніший.
                Я б використав "foreach" коли мені потрібно просто пройтися по всіх елементах масиву та щось з ними зробити, 
                    але без потреби змінювати їх або знати їх позиції.
                Для прикладу будемо й далі використовувати тему оцінок :)
                    "foreach" можна використати, наприклад, для виводу оцінок учня, підрахунку їхньої кількості або обчислення середнього арифметичного.
                    Я оберу варіант з середнім арифеметичним:
                        int[] grades = { 10, 7, 9, 9, 11 };
                        int gradesSum = 0;
                        int gradesCount = 0;
                        
                        foreach (int grade in grades)
                        {
                            gradesCount++; // хоча можна було б використати .Length, але ми використовуємо foreach ;)
                            gradesSum += grade;
                        }
                        double gradesAverage = (double)gradesSum / gradesCount;
                        
                        Console.WriteLine($"Середнє арифметичне оцінок учня: {gradesAverage}");

                        В цьому прикладі "foreach" зручніший за "for" через те, що не потрібно створювати лічильник "i", 
                            не потрібно писати умову типу "i < grades.Length" та звертатися до елементу через "grades[i]".
             

            5. Є змінна, яка іноді може містити `null`. Придумай власний приклад, де тобі було б зручно використати `?.` або `??`. Покажи невеликий фрагмент коду та поясни, що в ньому відбувається.
                Ігри, наші улюблені ігри. Можна взяти такий приклад: У персонажа може бути зброя, але зараз її немає, не знайшов. 
                    Тоді змінна може містити null, для такої ситуції ми використаємо нулейбл-змінну - "varType? varName" і зможемо безпечно дізнатися назву зброї.
                Приклад коду:
                    Weapon? equippedWeapon = null;
                    Console.WriteLine($"Equipped weapon: {equippedWeapon?.Name ?? "No weapon"}"); // Заодно використаємо "??" щоб вивід був гарніший аніж "null".
                
                Якщо зброя є, програма виведе її назву. Якщо зброї немає, тобто "equippedWeapon = null", 
                    а завдяки "?" захищаємось від помилки бо програма не намагатиметься звернутись до ".Name", а просто поверне null.
                        А оператор "??" в нашому випадку зробить вивід красивим, оскільки замість "null" виведе наперед готову стрічку "No weapon".
            
            
            6. Створи рядок із будь-яким текстом на власну тему та виконай із ним щонайменше три різні операції. Наприклад: пошук, заміна, зміна регістру, отримання частини рядка або розділення. Поясни результат кожної операції.
                Наприклад нам потрібно відредагувати файл .mp3, стрічка буде з інформацією про назву пісні, автора та альбом. 
                    Завдання програми - знайти поле про альбом, та перевірити чи ця пісня з якогось альбому чи ні. Також змінити назву пісні. І ще змінити те, як прописаний автор на повністю великі букві.
                
                string songProperties = "Title=Animal I Have Become; Artist=Three Days Grace; Album=One-X";
                
                string[] songParts = songProperties.Split(';'); // поділяє стрічку на частини, до зазначеного символу ";" та записує в масив стрічок.
                
                string album = songParts[2].Replace("Album=", "").Trim(); // прибираємо пробіли на початку та в кінці стрічки (на моменті тесту очі бісило ;D)
                bool hasAlbum = album != "No album";

                string updatedSongProperties = songProperties.Replace("Title=Animal I Have Become", "Title=Never Too Late"); // створюємо нову стрічку та записуємо туди назву, але змінюємо орігінальну на нову.
                
                string artist = songParts[1].Replace("Artist=", "").Trim().ToUpper(); // створюємо стрічку в яку записуємо витягнуту стрічку про виконавця з масиву частин оригінальної стрічки. Та знову прибираємо пробіли спочатку і в кінці, а також робимо текст повністю з великих літер
                updatedSongProperties = updatedSongProperties.Replace("Artist=Three Days Grace", $"Artist={artist}") // додаємо до нової стрічки змінену стрічку про виконавця

                Console.WriteLine(hasAlbum ? $"This song is from the album: {album}" : "This song doesn't belong to an album.")
                Console.WriteLine(updatedSongProperties);

            
            7. Рядок у C# не можна змінити після його створення. Поясни своїми словами, що це означає. Наведи приклад коду, де здається, що рядок змінюється, і поясни, що відбувається насправді.
                Ми не можемо просто взяти та змінити одну букву або слово в уже існуючому рядку. 
                Якщо ми використовуємо, наприклад, "Replace()" або "ToUpper()", то ці методи насправді створюють новий рядок.
                Прикладом, де здається, що рядок змінився можна взяти щось схоже на минуле завдання:
                    string songTitle = "Animal I Have Become";
                    songTitle = songTitle.Replace("Animal", "Human");
                    Console.WriteLine(songTitle);
                Здається, що рядок "songTitle" змінився, але насправді метод ".Replace()" створив новий рядок "Human I Have Become", 
                    а змінна "songTitle" просто почала зберігати його. А старий рядок "Animal I Have Become" так і не змінився.


            8. Напиши невелику програму на 10–20 рядків, яка використовує одночасно масив і рядки. Ідею програми придумай сам. Коротко поясни, для чого в ній потрібен масив і які операції виконуються з рядками.
                Можна продовжити тему з музикою та зробити маленьку програму, яка шукає пісні конкретного виконавця в плейлисті.
                
                string[] playlist =
                {
                    "Three Days Grace - Animal I Have Become",
                    "Linkin Park - Numb",
                    "Three Days Grace - Never Too Late",
                    "Skillet - Monster",
                    "Three Days Grace - I Hate Everything About You"
                };

                string artistToFind = "Three Days Grace";
                int foundSongs = 0;

                foreach (string song in playlist)
                {
                    if (song.Contains(artistToFind)) // шкода що ми такі методи не розбирали, в цілому теми стрічок майже не було на парі :(  доводиться гуглити, але це теж добре, гуглити треба вміти.
                    {
                        string songTitle = song.Replace($"{artistToFind} - ", "");
                        Console.WriteLine(songTitle.ToUpper());
                        foundSongs++;
                    }
                }

                Console.WriteLine($"Songs found: {foundSongs}");

                
            9. Яка тема цього модуля здалася тобі найскладнішою: типи масивів, `foreach`, робота з `null` чи рядки? Поясни, що саме в ній поки викликає питання.
                Найскладнішої відилити не можу, вони всі поодинці щось типу середньої складності, хоча мабуть типи масивів, а точніше робота з масивами може бути далі більша. Але зараз щось найскладніше виділити просто не можу.
                Але викликає питання тема рядків, ми її майже не розібрали, було б непогано подивитись на методи, які є саме в C#. Типу того ж .Contains(), .Replace()
         */
    }
}
